Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetUseBuiltInMatchingForCategories
Get the categories that utilize specialized matching.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetUseBuiltInMatchingForCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the categories that utilize specialized matching.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetPartitioningParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Parameters used for partitioning elements in this schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetPartitioningParameters
Parameters used for partitioning elements in this schema.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetFormatting(Autodesk.Revit.DB.NumberingFormatSettings)
Set configuration for formatting
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetFormatting
Get configuration for formatting
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetMatchingParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Parameters used for matching elements in this schema.
matchingParameters:
Parameters used to determine which elements are assigned the same number.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetMatchingParameters
Parameters used for matching elements in this schema.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Categories that will be used with this NumberingSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetCategories
Categories used with this NumberingSchema.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetNumberingOutputParameter(Autodesk.Revit.DB.NumberingParameter)
Sets the output param
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.GetNumberingOutputParameter
Gets the output param
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.SetScopeFilter(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Set the filter that determines the scope for this NumberingSchema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.MatchGeometry
True if the geometry is used for matching.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.FilterId
Filter that determines the elements affected by this NumberingSchema.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Enabled
Is NumberingSchema enabled.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.OldName
NumberingSchema name as it was before the settings were updated.
Remarks:
This member is not used in the determination of equallity for this object.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Name
NumberingSchema name.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.Priority
NumberingSchema priority.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings.#ctor
Create an empty AdvancedNumberingSchemaSettings object.
Since:
2027

Autodesk.Revit.DB.AdvancedNumberingSchemaSettings
A class containing the settings related to a NumberingSchema object.
Since:
2027